#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.aws-iam.aws_iam_access_key.admin_terraform_cloud will be created
  + resource "aws_iam_access_key" "admin_terraform_cloud" {
      + encrypted_secret     = (known after apply)
      + id                   = (known after apply)
      + key_fingerprint      = (known after apply)
      + secret               = (sensitive value)
      + ses_smtp_password    = (sensitive value)
      + ses_smtp_password_v4 = (sensitive value)
      + status               = (known after apply)
      + user                 = "admin-terraform-cloud"
    }

  # module.aws-lambda-cost.data.archive_file.aws_lambda_cost will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "aws_lambda_cost"  {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "modules/aws-lambda-cost/lambda.zip"
      + output_sha          = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "modules/aws-lambda-cost/main.py"
      + type                = "zip"
    }

  # module.aws-lambda-cost.aws_cloudwatch_event_rule.aws_lambda_cost must be replaced
-/+ resource "aws_cloudwatch_event_rule" "aws_lambda_cost" {
      ~ arn                 = "arn:aws:events:us-east-1:589845989135:rule/aws_lambda_cost" -> (known after apply)
        description         = "Every 30 minutes"
      ~ id                  = "aws_lambda_cost" -> (known after apply)
        is_enabled          = true
      ~ name                = "aws_lambda_cost" -> "aws-lambda-cost" # forces replacement
        schedule_expression = "rate(30 minutes)"
      - tags                = {} -> null
    }

  # module.aws-lambda-cost.aws_cloudwatch_event_rule.aws_lambda_cost_log will be created
  + resource "aws_cloudwatch_event_rule" "aws_lambda_cost_log" {
      + arn                 = (known after apply)
      + description         = "Every 30 minutes"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "aws-lambda-cost-log"
      + schedule_expression = "rate(30 minutes)"
    }

  # module.aws-lambda-cost.aws_cloudwatch_event_target.aws_lambda_cost must be replaced
-/+ resource "aws_cloudwatch_event_target" "aws_lambda_cost" {
        arn       = "arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost"
      ~ id        = "aws_lambda_cost-aws_lambda_cost" -> (known after apply)
      ~ rule      = "aws_lambda_cost" -> "aws-lambda-cost" # forces replacement
      ~ target_id = "aws_lambda_cost" -> "aws-lambda-cost" # forces replacement
    }

  # module.aws-lambda-cost.aws_cloudwatch_event_target.aws_lambda_cost_log will be created
  + resource "aws_cloudwatch_event_target" "aws_lambda_cost_log" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + rule      = "aws-lambda-cost-log"
      + target_id = "aws-lambda-cost-log"
    }

  # module.aws-lambda-cost.aws_lambda_function.aws_lambda_cost will be updated in-place
  ~ resource "aws_lambda_function" "aws_lambda_cost" {
        arn                            = "arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost"
        filename                       = "modules/aws-lambda-cost/lambda.zip"
        function_name                  = "aws-lambda-cost"
        handler                        = "main.lambda_handler"
        id                             = "aws-lambda-cost"
        invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost/invocations"
      ~ last_modified                  = "2020-03-03T06:35:38.731+0000" -> (known after apply)
        layers                         = []
        memory_size                    = 128
        publish                        = false
        qualified_arn                  = "arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost:$LATEST"
        reserved_concurrent_executions = -1
        role                           = "arn:aws:iam::589845989135:role/aws-lambda-cost"
        runtime                        = "python3.7"
      ~ source_code_hash               = "pRl+mX4lRsJeVTxBboOqg92exc6+U/xOqLOsmlippdo=" -> (known after apply)
        source_code_size               = 901
        tags                           = {}
        timeout                        = 3
        version                        = "$LATEST"

      ~ environment {
          ~ variables = {
              + "SLACK_CHANNEL_NAME" = "aws-cost"
              ~ "SLACK_POST_URL"     = "https://hooks.slack.com/services/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" -> "https://hooks.slack.com/services/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"
            }
        }

        tracing_config {
            mode = "PassThrough"
        }
    }

  # module.aws-lambda-cost.aws_lambda_function.aws_lambda_cost_log will be created
  + resource "aws_lambda_function" "aws_lambda_cost_log" {
      + arn                            = (known after apply)
      + filename                       = "modules/aws-lambda-cost/lambda.zip"
      + function_name                  = "aws-lambda-cost-log"
      + handler                        = "main.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::589845989135:role/aws-lambda-cost"
      + runtime                        = "python3.7"
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "SLACK_CHANNEL_NAME" = "aws-cost-log"
              + "SLACK_POST_URL"     = "https://hooks.slack.com/services/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"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.aws-lambda-cost.aws_lambda_permission.aws_lambda_cost must be replaced
-/+ resource "aws_lambda_permission" "aws_lambda_cost" {
        action        = "lambda:InvokeFunction"
        function_name = "aws-lambda-cost"
      ~ id            = "AllowExecutionFromCloudWatch" -> (known after apply)
        principal     = "events.amazonaws.com"
      ~ source_arn    = "arn:aws:events:us-east-1:589845989135:rule/aws_lambda_cost" -> (known after apply) # forces replacement
        statement_id  = "AllowExecutionFromCloudWatch"
    }

  # module.aws-lambda-cost.aws_lambda_permission.aws_lambda_cost_log will be created
  + resource "aws_lambda_permission" "aws_lambda_cost_log" {
      + action        = "lambda:InvokeFunction"
      + function_name = "aws-lambda-cost-log"
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromCloudWatch"
    }

  # module.aws-lambda-cost.null_resource.aws_lambda_cost must be replaced
-/+ resource "null_resource" "aws_lambda_cost" {
      ~ id       = "4796230773096970427" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "source_code_hash" = "LdAJW67hERQXp5QqbEJf7Hm1i9X5xxLFxOqxYYrNt1g=" -> "NvkPR1el4FgkMIcWQ3T1HQfPoI13k1rdKKu9bgcnS5c="
        }
    }

Plan: 9 to add, 1 to change, 4 to destroy.
```

</details>

*Workflow: `Terraform Pull Request`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
